{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "d34fd725",
   "metadata": {},
   "source": [
    "# Bite-Sized Neo4j for Data Scientists\n",
    "## Part 8: Importing data into the database from a JSON file\n",
    "\n",
    "This video is about importing data from a properly-formatted JSON file into a Neo4j database.  The data comes from the [Kaggle 2020 Machine Learning and Data Science Survey](https://www.kaggle.com/c/kaggle-survey-2020).  There are 355 columns for this data, so I went ahead and selected a subset of those that I thought would be interesting.\n",
    "\n",
    "The notebook just shows how I created the JSON file.  I ran this on my local machine (see the uri and password when I make the connection to Neo4j below) using the Docker container from [this blog post](https://dev.neo4j.com/docker_neo_jupyter) on Towards Data Science.  That container has both Neo4j and Jupyter so you can run and network them together and can be used for anything.  You don't actually need this bit since this video just goes over the data import.  I just wanted to provide it so you can see how I created the dataset.\n",
    "\n",
    "Once the graph is populated below, I use \n",
    "\n",
    "```\n",
    "CALL apoc.export.json.all(\"kaggle.json\",{useTypes:true})\n",
    "```\n",
    "\n",
    "to export the graph to JSON, which puts it in the ` /var/lib/neo4j/import` directory in the Neo4j part of the container, which is then available through volume forwarding in `$HOME/graph_data/my_data`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "da48b9f7",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "d681476f",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "/opt/conda/lib/python3.9/site-packages/IPython/core/interactiveshell.py:3441: DtypeWarning: Columns (0) have mixed types.Specify dtype option on import or set low_memory=False.\n",
      "  exec(code_obj, self.user_global_ns, self.user_ns)\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Time from Start to Finish (seconds)</th>\n",
       "      <th>Q1</th>\n",
       "      <th>Q2</th>\n",
       "      <th>Q3</th>\n",
       "      <th>Q4</th>\n",
       "      <th>Q5</th>\n",
       "      <th>Q6</th>\n",
       "      <th>Q7_Part_1</th>\n",
       "      <th>Q7_Part_2</th>\n",
       "      <th>Q7_Part_3</th>\n",
       "      <th>...</th>\n",
       "      <th>Q35_B_Part_2</th>\n",
       "      <th>Q35_B_Part_3</th>\n",
       "      <th>Q35_B_Part_4</th>\n",
       "      <th>Q35_B_Part_5</th>\n",
       "      <th>Q35_B_Part_6</th>\n",
       "      <th>Q35_B_Part_7</th>\n",
       "      <th>Q35_B_Part_8</th>\n",
       "      <th>Q35_B_Part_9</th>\n",
       "      <th>Q35_B_Part_10</th>\n",
       "      <th>Q35_B_OTHER</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Duration (in seconds)</td>\n",
       "      <td>What is your age (# years)?</td>\n",
       "      <td>What is your gender? - Selected Choice</td>\n",
       "      <td>In which country do you currently reside?</td>\n",
       "      <td>What is the highest level of formal education ...</td>\n",
       "      <td>Select the title most similar to your current ...</td>\n",
       "      <td>For how many years have you been writing code ...</td>\n",
       "      <td>What programming languages do you use on a reg...</td>\n",
       "      <td>What programming languages do you use on a reg...</td>\n",
       "      <td>What programming languages do you use on a reg...</td>\n",
       "      <td>...</td>\n",
       "      <td>In the next 2 years, do you hope to become mor...</td>\n",
       "      <td>In the next 2 years, do you hope to become mor...</td>\n",
       "      <td>In the next 2 years, do you hope to become mor...</td>\n",
       "      <td>In the next 2 years, do you hope to become mor...</td>\n",
       "      <td>In the next 2 years, do you hope to become mor...</td>\n",
       "      <td>In the next 2 years, do you hope to become mor...</td>\n",
       "      <td>In the next 2 years, do you hope to become mor...</td>\n",
       "      <td>In the next 2 years, do you hope to become mor...</td>\n",
       "      <td>In the next 2 years, do you hope to become mor...</td>\n",
       "      <td>In the next 2 years, do you hope to become mor...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1838</td>\n",
       "      <td>35-39</td>\n",
       "      <td>Man</td>\n",
       "      <td>Colombia</td>\n",
       "      <td>Doctoral degree</td>\n",
       "      <td>Student</td>\n",
       "      <td>5-10 years</td>\n",
       "      <td>Python</td>\n",
       "      <td>R</td>\n",
       "      <td>SQL</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>TensorBoard</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>289287</td>\n",
       "      <td>30-34</td>\n",
       "      <td>Man</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>Master’s degree</td>\n",
       "      <td>Data Engineer</td>\n",
       "      <td>5-10 years</td>\n",
       "      <td>Python</td>\n",
       "      <td>R</td>\n",
       "      <td>SQL</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>860</td>\n",
       "      <td>35-39</td>\n",
       "      <td>Man</td>\n",
       "      <td>Argentina</td>\n",
       "      <td>Bachelor’s degree</td>\n",
       "      <td>Software Engineer</td>\n",
       "      <td>10-20 years</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>None</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>507</td>\n",
       "      <td>30-34</td>\n",
       "      <td>Man</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>Master’s degree</td>\n",
       "      <td>Data Scientist</td>\n",
       "      <td>5-10 years</td>\n",
       "      <td>Python</td>\n",
       "      <td>NaN</td>\n",
       "      <td>SQL</td>\n",
       "      <td>...</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5 rows × 355 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "  Time from Start to Finish (seconds)                           Q1  \\\n",
       "0               Duration (in seconds)  What is your age (# years)?   \n",
       "1                                1838                        35-39   \n",
       "2                              289287                        30-34   \n",
       "3                                 860                        35-39   \n",
       "4                                 507                        30-34   \n",
       "\n",
       "                                       Q2  \\\n",
       "0  What is your gender? - Selected Choice   \n",
       "1                                     Man   \n",
       "2                                     Man   \n",
       "3                                     Man   \n",
       "4                                     Man   \n",
       "\n",
       "                                          Q3  \\\n",
       "0  In which country do you currently reside?   \n",
       "1                                   Colombia   \n",
       "2                   United States of America   \n",
       "3                                  Argentina   \n",
       "4                   United States of America   \n",
       "\n",
       "                                                  Q4  \\\n",
       "0  What is the highest level of formal education ...   \n",
       "1                                    Doctoral degree   \n",
       "2                                    Master’s degree   \n",
       "3                                  Bachelor’s degree   \n",
       "4                                    Master’s degree   \n",
       "\n",
       "                                                  Q5  \\\n",
       "0  Select the title most similar to your current ...   \n",
       "1                                            Student   \n",
       "2                                      Data Engineer   \n",
       "3                                  Software Engineer   \n",
       "4                                     Data Scientist   \n",
       "\n",
       "                                                  Q6  \\\n",
       "0  For how many years have you been writing code ...   \n",
       "1                                         5-10 years   \n",
       "2                                         5-10 years   \n",
       "3                                        10-20 years   \n",
       "4                                         5-10 years   \n",
       "\n",
       "                                           Q7_Part_1  \\\n",
       "0  What programming languages do you use on a reg...   \n",
       "1                                             Python   \n",
       "2                                             Python   \n",
       "3                                                NaN   \n",
       "4                                             Python   \n",
       "\n",
       "                                           Q7_Part_2  \\\n",
       "0  What programming languages do you use on a reg...   \n",
       "1                                                  R   \n",
       "2                                                  R   \n",
       "3                                                NaN   \n",
       "4                                                NaN   \n",
       "\n",
       "                                           Q7_Part_3  ...  \\\n",
       "0  What programming languages do you use on a reg...  ...   \n",
       "1                                                SQL  ...   \n",
       "2                                                SQL  ...   \n",
       "3                                                NaN  ...   \n",
       "4                                                SQL  ...   \n",
       "\n",
       "                                        Q35_B_Part_2  \\\n",
       "0  In the next 2 years, do you hope to become mor...   \n",
       "1                                                NaN   \n",
       "2                                                NaN   \n",
       "3                                                NaN   \n",
       "4                                                NaN   \n",
       "\n",
       "                                        Q35_B_Part_3  \\\n",
       "0  In the next 2 years, do you hope to become mor...   \n",
       "1                                                NaN   \n",
       "2                                                NaN   \n",
       "3                                                NaN   \n",
       "4                                                NaN   \n",
       "\n",
       "                                        Q35_B_Part_4  \\\n",
       "0  In the next 2 years, do you hope to become mor...   \n",
       "1                                                NaN   \n",
       "2                                                NaN   \n",
       "3                                                NaN   \n",
       "4                                                NaN   \n",
       "\n",
       "                                        Q35_B_Part_5  \\\n",
       "0  In the next 2 years, do you hope to become mor...   \n",
       "1                                       TensorBoard    \n",
       "2                                                NaN   \n",
       "3                                                NaN   \n",
       "4                                                NaN   \n",
       "\n",
       "                                        Q35_B_Part_6  \\\n",
       "0  In the next 2 years, do you hope to become mor...   \n",
       "1                                                NaN   \n",
       "2                                                NaN   \n",
       "3                                                NaN   \n",
       "4                                                NaN   \n",
       "\n",
       "                                        Q35_B_Part_7  \\\n",
       "0  In the next 2 years, do you hope to become mor...   \n",
       "1                                                NaN   \n",
       "2                                                NaN   \n",
       "3                                                NaN   \n",
       "4                                                NaN   \n",
       "\n",
       "                                        Q35_B_Part_8  \\\n",
       "0  In the next 2 years, do you hope to become mor...   \n",
       "1                                                NaN   \n",
       "2                                                NaN   \n",
       "3                                                NaN   \n",
       "4                                                NaN   \n",
       "\n",
       "                                        Q35_B_Part_9  \\\n",
       "0  In the next 2 years, do you hope to become mor...   \n",
       "1                                                NaN   \n",
       "2                                                NaN   \n",
       "3                                                NaN   \n",
       "4                                                NaN   \n",
       "\n",
       "                                       Q35_B_Part_10  \\\n",
       "0  In the next 2 years, do you hope to become mor...   \n",
       "1                                                NaN   \n",
       "2                                                NaN   \n",
       "3                                               None   \n",
       "4                                                NaN   \n",
       "\n",
       "                                         Q35_B_OTHER  \n",
       "0  In the next 2 years, do you hope to become mor...  \n",
       "1                                                NaN  \n",
       "2                                                NaN  \n",
       "3                                                NaN  \n",
       "4                                                NaN  \n",
       "\n",
       "[5 rows x 355 columns]"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "orig_df = pd.read_csv('./data/kaggle_survey_2020_responses.csv')\n",
    "orig_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "ce8ff43e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(20037, 355)"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "orig_df.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "4f9e03f6",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Time from Start to Finish (seconds)\n",
      "Q1\n",
      "Q2\n",
      "Q3\n",
      "Q4\n",
      "Q5\n",
      "Q6\n",
      "Q7_Part_1\n",
      "Q7_Part_2\n",
      "Q7_Part_3\n",
      "Q7_Part_4\n",
      "Q7_Part_5\n",
      "Q7_Part_6\n",
      "Q7_Part_7\n",
      "Q7_Part_8\n",
      "Q7_Part_9\n",
      "Q7_Part_10\n",
      "Q7_Part_11\n",
      "Q7_Part_12\n",
      "Q7_OTHER\n",
      "Q8\n",
      "Q9_Part_1\n",
      "Q9_Part_2\n",
      "Q9_Part_3\n",
      "Q9_Part_4\n",
      "Q9_Part_5\n",
      "Q9_Part_6\n",
      "Q9_Part_7\n",
      "Q9_Part_8\n",
      "Q9_Part_9\n",
      "Q9_Part_10\n",
      "Q9_Part_11\n",
      "Q9_OTHER\n",
      "Q10_Part_1\n",
      "Q10_Part_2\n",
      "Q10_Part_3\n",
      "Q10_Part_4\n",
      "Q10_Part_5\n",
      "Q10_Part_6\n",
      "Q10_Part_7\n",
      "Q10_Part_8\n",
      "Q10_Part_9\n",
      "Q10_Part_10\n",
      "Q10_Part_11\n",
      "Q10_Part_12\n",
      "Q10_Part_13\n",
      "Q10_OTHER\n",
      "Q11\n",
      "Q12_Part_1\n",
      "Q12_Part_2\n",
      "Q12_Part_3\n",
      "Q12_OTHER\n",
      "Q13\n",
      "Q14_Part_1\n",
      "Q14_Part_2\n",
      "Q14_Part_3\n",
      "Q14_Part_4\n",
      "Q14_Part_5\n",
      "Q14_Part_6\n",
      "Q14_Part_7\n",
      "Q14_Part_8\n",
      "Q14_Part_9\n",
      "Q14_Part_10\n",
      "Q14_Part_11\n",
      "Q14_OTHER\n",
      "Q15\n",
      "Q16_Part_1\n",
      "Q16_Part_2\n",
      "Q16_Part_3\n",
      "Q16_Part_4\n",
      "Q16_Part_5\n",
      "Q16_Part_6\n",
      "Q16_Part_7\n",
      "Q16_Part_8\n",
      "Q16_Part_9\n",
      "Q16_Part_10\n",
      "Q16_Part_11\n",
      "Q16_Part_12\n",
      "Q16_Part_13\n",
      "Q16_Part_14\n",
      "Q16_Part_15\n",
      "Q16_OTHER\n",
      "Q17_Part_1\n",
      "Q17_Part_2\n",
      "Q17_Part_3\n",
      "Q17_Part_4\n",
      "Q17_Part_5\n",
      "Q17_Part_6\n",
      "Q17_Part_7\n",
      "Q17_Part_8\n",
      "Q17_Part_9\n",
      "Q17_Part_10\n",
      "Q17_Part_11\n",
      "Q17_OTHER\n",
      "Q18_Part_1\n",
      "Q18_Part_2\n",
      "Q18_Part_3\n",
      "Q18_Part_4\n",
      "Q18_Part_5\n",
      "Q18_Part_6\n",
      "Q18_OTHER\n",
      "Q19_Part_1\n",
      "Q19_Part_2\n",
      "Q19_Part_3\n",
      "Q19_Part_4\n",
      "Q19_Part_5\n",
      "Q19_OTHER\n",
      "Q20\n",
      "Q21\n",
      "Q22\n",
      "Q23_Part_1\n",
      "Q23_Part_2\n",
      "Q23_Part_3\n",
      "Q23_Part_4\n",
      "Q23_Part_5\n",
      "Q23_Part_6\n",
      "Q23_Part_7\n",
      "Q23_OTHER\n",
      "Q24\n",
      "Q25\n",
      "Q26_A_Part_1\n",
      "Q26_A_Part_2\n",
      "Q26_A_Part_3\n",
      "Q26_A_Part_4\n",
      "Q26_A_Part_5\n",
      "Q26_A_Part_6\n",
      "Q26_A_Part_7\n",
      "Q26_A_Part_8\n",
      "Q26_A_Part_9\n",
      "Q26_A_Part_10\n",
      "Q26_A_Part_11\n",
      "Q26_A_OTHER\n",
      "Q27_A_Part_1\n",
      "Q27_A_Part_2\n",
      "Q27_A_Part_3\n",
      "Q27_A_Part_4\n",
      "Q27_A_Part_5\n",
      "Q27_A_Part_6\n",
      "Q27_A_Part_7\n",
      "Q27_A_Part_8\n",
      "Q27_A_Part_9\n",
      "Q27_A_Part_10\n",
      "Q27_A_Part_11\n",
      "Q27_A_OTHER\n",
      "Q28_A_Part_1\n",
      "Q28_A_Part_2\n",
      "Q28_A_Part_3\n",
      "Q28_A_Part_4\n",
      "Q28_A_Part_5\n",
      "Q28_A_Part_6\n",
      "Q28_A_Part_7\n",
      "Q28_A_Part_8\n",
      "Q28_A_Part_9\n",
      "Q28_A_Part_10\n",
      "Q28_A_OTHER\n",
      "Q29_A_Part_1\n",
      "Q29_A_Part_2\n",
      "Q29_A_Part_3\n",
      "Q29_A_Part_4\n",
      "Q29_A_Part_5\n",
      "Q29_A_Part_6\n",
      "Q29_A_Part_7\n",
      "Q29_A_Part_8\n",
      "Q29_A_Part_9\n",
      "Q29_A_Part_10\n",
      "Q29_A_Part_11\n",
      "Q29_A_Part_12\n",
      "Q29_A_Part_13\n",
      "Q29_A_Part_14\n",
      "Q29_A_Part_15\n",
      "Q29_A_Part_16\n",
      "Q29_A_Part_17\n",
      "Q29_A_OTHER\n",
      "Q30\n",
      "Q31_A_Part_1\n",
      "Q31_A_Part_2\n",
      "Q31_A_Part_3\n",
      "Q31_A_Part_4\n",
      "Q31_A_Part_5\n",
      "Q31_A_Part_6\n",
      "Q31_A_Part_7\n",
      "Q31_A_Part_8\n",
      "Q31_A_Part_9\n",
      "Q31_A_Part_10\n",
      "Q31_A_Part_11\n",
      "Q31_A_Part_12\n",
      "Q31_A_Part_13\n",
      "Q31_A_Part_14\n",
      "Q31_A_OTHER\n",
      "Q32\n",
      "Q33_A_Part_1\n",
      "Q33_A_Part_2\n",
      "Q33_A_Part_3\n",
      "Q33_A_Part_4\n",
      "Q33_A_Part_5\n",
      "Q33_A_Part_6\n",
      "Q33_A_Part_7\n",
      "Q33_A_OTHER\n",
      "Q34_A_Part_1\n",
      "Q34_A_Part_2\n",
      "Q34_A_Part_3\n",
      "Q34_A_Part_4\n",
      "Q34_A_Part_5\n",
      "Q34_A_Part_6\n",
      "Q34_A_Part_7\n",
      "Q34_A_Part_8\n",
      "Q34_A_Part_9\n",
      "Q34_A_Part_10\n",
      "Q34_A_Part_11\n",
      "Q34_A_OTHER\n",
      "Q35_A_Part_1\n",
      "Q35_A_Part_2\n",
      "Q35_A_Part_3\n",
      "Q35_A_Part_4\n",
      "Q35_A_Part_5\n",
      "Q35_A_Part_6\n",
      "Q35_A_Part_7\n",
      "Q35_A_Part_8\n",
      "Q35_A_Part_9\n",
      "Q35_A_Part_10\n",
      "Q35_A_OTHER\n",
      "Q36_Part_1\n",
      "Q36_Part_2\n",
      "Q36_Part_3\n",
      "Q36_Part_4\n",
      "Q36_Part_5\n",
      "Q36_Part_6\n",
      "Q36_Part_7\n",
      "Q36_Part_8\n",
      "Q36_Part_9\n",
      "Q36_OTHER\n",
      "Q37_Part_1\n",
      "Q37_Part_2\n",
      "Q37_Part_3\n",
      "Q37_Part_4\n",
      "Q37_Part_5\n",
      "Q37_Part_6\n",
      "Q37_Part_7\n",
      "Q37_Part_8\n",
      "Q37_Part_9\n",
      "Q37_Part_10\n",
      "Q37_Part_11\n",
      "Q37_OTHER\n",
      "Q38\n",
      "Q39_Part_1\n",
      "Q39_Part_2\n",
      "Q39_Part_3\n",
      "Q39_Part_4\n",
      "Q39_Part_5\n",
      "Q39_Part_6\n",
      "Q39_Part_7\n",
      "Q39_Part_8\n",
      "Q39_Part_9\n",
      "Q39_Part_10\n",
      "Q39_Part_11\n",
      "Q39_OTHER\n",
      "Q26_B_Part_1\n",
      "Q26_B_Part_2\n",
      "Q26_B_Part_3\n",
      "Q26_B_Part_4\n",
      "Q26_B_Part_5\n",
      "Q26_B_Part_6\n",
      "Q26_B_Part_7\n",
      "Q26_B_Part_8\n",
      "Q26_B_Part_9\n",
      "Q26_B_Part_10\n",
      "Q26_B_Part_11\n",
      "Q26_B_OTHER\n",
      "Q27_B_Part_1\n",
      "Q27_B_Part_2\n",
      "Q27_B_Part_3\n",
      "Q27_B_Part_4\n",
      "Q27_B_Part_5\n",
      "Q27_B_Part_6\n",
      "Q27_B_Part_7\n",
      "Q27_B_Part_8\n",
      "Q27_B_Part_9\n",
      "Q27_B_Part_10\n",
      "Q27_B_Part_11\n",
      "Q27_B_OTHER\n",
      "Q28_B_Part_1\n",
      "Q28_B_Part_2\n",
      "Q28_B_Part_3\n",
      "Q28_B_Part_4\n",
      "Q28_B_Part_5\n",
      "Q28_B_Part_6\n",
      "Q28_B_Part_7\n",
      "Q28_B_Part_8\n",
      "Q28_B_Part_9\n",
      "Q28_B_Part_10\n",
      "Q28_B_OTHER\n",
      "Q29_B_Part_1\n",
      "Q29_B_Part_2\n",
      "Q29_B_Part_3\n",
      "Q29_B_Part_4\n",
      "Q29_B_Part_5\n",
      "Q29_B_Part_6\n",
      "Q29_B_Part_7\n",
      "Q29_B_Part_8\n",
      "Q29_B_Part_9\n",
      "Q29_B_Part_10\n",
      "Q29_B_Part_11\n",
      "Q29_B_Part_12\n",
      "Q29_B_Part_13\n",
      "Q29_B_Part_14\n",
      "Q29_B_Part_15\n",
      "Q29_B_Part_16\n",
      "Q29_B_Part_17\n",
      "Q29_B_OTHER\n",
      "Q31_B_Part_1\n",
      "Q31_B_Part_2\n",
      "Q31_B_Part_3\n",
      "Q31_B_Part_4\n",
      "Q31_B_Part_5\n",
      "Q31_B_Part_6\n",
      "Q31_B_Part_7\n",
      "Q31_B_Part_8\n",
      "Q31_B_Part_9\n",
      "Q31_B_Part_10\n",
      "Q31_B_Part_11\n",
      "Q31_B_Part_12\n",
      "Q31_B_Part_13\n",
      "Q31_B_Part_14\n",
      "Q31_B_OTHER\n",
      "Q33_B_Part_1\n",
      "Q33_B_Part_2\n",
      "Q33_B_Part_3\n",
      "Q33_B_Part_4\n",
      "Q33_B_Part_5\n",
      "Q33_B_Part_6\n",
      "Q33_B_Part_7\n",
      "Q33_B_OTHER\n",
      "Q34_B_Part_1\n",
      "Q34_B_Part_2\n",
      "Q34_B_Part_3\n",
      "Q34_B_Part_4\n",
      "Q34_B_Part_5\n",
      "Q34_B_Part_6\n",
      "Q34_B_Part_7\n",
      "Q34_B_Part_8\n",
      "Q34_B_Part_9\n",
      "Q34_B_Part_10\n",
      "Q34_B_Part_11\n",
      "Q34_B_OTHER\n",
      "Q35_B_Part_1\n",
      "Q35_B_Part_2\n",
      "Q35_B_Part_3\n",
      "Q35_B_Part_4\n",
      "Q35_B_Part_5\n",
      "Q35_B_Part_6\n",
      "Q35_B_Part_7\n",
      "Q35_B_Part_8\n",
      "Q35_B_Part_9\n",
      "Q35_B_Part_10\n",
      "Q35_B_OTHER\n"
     ]
    }
   ],
   "source": [
    "for col in orig_df.columns:\n",
    "    print(col)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f577ba5f",
   "metadata": {},
   "source": [
    "## Select the columns we are going to use to populate the graph and put them in a usable format\n",
    "\n",
    "Consult the Kaggle report to understand what each question means."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "751e5248",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>country</th>\n",
       "      <th>current_role</th>\n",
       "      <th>num_years_coding</th>\n",
       "      <th>num_data_scientist_team</th>\n",
       "      <th>ml_budget</th>\n",
       "      <th>recommended_language</th>\n",
       "      <th>most_used_database</th>\n",
       "      <th>languages</th>\n",
       "      <th>databases</th>\n",
       "      <th>auto_ml</th>\n",
       "      <th>frameworks</th>\n",
       "      <th>ml_products</th>\n",
       "      <th>viz_tools</th>\n",
       "      <th>social_media</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "      <td>Colombia</td>\n",
       "      <td>Student</td>\n",
       "      <td>5-10 years</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Python</td>\n",
       "      <td>NaN</td>\n",
       "      <td>[Python, R, SQL, C, Javascript, MATLAB, Other]</td>\n",
       "      <td>[MongoDB , Microsoft SQL Server , Google Cloud...</td>\n",
       "      <td>[ Google Cloud AutoML ,  Databricks AutoML ,  ...</td>\n",
       "      <td>[  TensorFlow ,  Keras ,  Xgboost ]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[ Matplotlib ,  Geoplotlib ]</td>\n",
       "      <td>[Kaggle (notebooks, forums, etc), Journal Publ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>Data Engineer</td>\n",
       "      <td>5-10 years</td>\n",
       "      <td>20+</td>\n",
       "      <td>$100,000 or more ($USD)</td>\n",
       "      <td>Python</td>\n",
       "      <td>PostgresSQL</td>\n",
       "      <td>[Python, R, SQL]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[  Scikit-learn ,   TensorFlow ,  Keras ,  PyT...</td>\n",
       "      <td>[ Amazon SageMaker ]</td>\n",
       "      <td>[ Matplotlib ,  Seaborn ,  Ggplot / ggplot2 , ...</td>\n",
       "      <td>[Twitter (data science influencers), Reddit (r...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3</td>\n",
       "      <td>Argentina</td>\n",
       "      <td>Software Engineer</td>\n",
       "      <td>10-20 years</td>\n",
       "      <td>0</td>\n",
       "      <td>$0 ($USD)</td>\n",
       "      <td>R</td>\n",
       "      <td>NaN</td>\n",
       "      <td>[Java, Javascript, Bash]</td>\n",
       "      <td>[MySQL , Microsoft SQL Server ]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[ D3 js ]</td>\n",
       "      <td>[Email newsletters (Data Elixir, O'Reilly Data...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>4</td>\n",
       "      <td>United States of America</td>\n",
       "      <td>Data Scientist</td>\n",
       "      <td>5-10 years</td>\n",
       "      <td>5-9</td>\n",
       "      <td>$10,000-$99,999</td>\n",
       "      <td>Python</td>\n",
       "      <td>MySQL</td>\n",
       "      <td>[Python, SQL, Bash]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[  Scikit-learn ,   TensorFlow ,  Keras ,  Xgb...</td>\n",
       "      <td>[No / None]</td>\n",
       "      <td>[ Matplotlib ,  Seaborn ,  Plotly / Plotly Exp...</td>\n",
       "      <td>[None]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5</td>\n",
       "      <td>Japan</td>\n",
       "      <td>Software Engineer</td>\n",
       "      <td>3-5 years</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>Python</td>\n",
       "      <td>NaN</td>\n",
       "      <td>[Python]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "      <td>[]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   id                   country       current_role num_years_coding  \\\n",
       "0   1                  Colombia            Student       5-10 years   \n",
       "1   2  United States of America      Data Engineer       5-10 years   \n",
       "2   3                 Argentina  Software Engineer      10-20 years   \n",
       "3   4  United States of America     Data Scientist       5-10 years   \n",
       "4   5                     Japan  Software Engineer        3-5 years   \n",
       "\n",
       "  num_data_scientist_team                ml_budget recommended_language  \\\n",
       "0                     NaN                      NaN               Python   \n",
       "1                     20+  $100,000 or more ($USD)               Python   \n",
       "2                       0                $0 ($USD)                    R   \n",
       "3                     5-9          $10,000-$99,999               Python   \n",
       "4                     NaN                      NaN               Python   \n",
       "\n",
       "  most_used_database                                       languages  \\\n",
       "0                NaN  [Python, R, SQL, C, Javascript, MATLAB, Other]   \n",
       "1       PostgresSQL                                 [Python, R, SQL]   \n",
       "2                NaN                        [Java, Javascript, Bash]   \n",
       "3             MySQL                              [Python, SQL, Bash]   \n",
       "4                NaN                                        [Python]   \n",
       "\n",
       "                                           databases  \\\n",
       "0  [MongoDB , Microsoft SQL Server , Google Cloud...   \n",
       "1                                                 []   \n",
       "2                    [MySQL , Microsoft SQL Server ]   \n",
       "3                                                 []   \n",
       "4                                                 []   \n",
       "\n",
       "                                             auto_ml  \\\n",
       "0  [ Google Cloud AutoML ,  Databricks AutoML ,  ...   \n",
       "1                                                 []   \n",
       "2                                                 []   \n",
       "3                                                 []   \n",
       "4                                                 []   \n",
       "\n",
       "                                          frameworks           ml_products  \\\n",
       "0                [  TensorFlow ,  Keras ,  Xgboost ]                    []   \n",
       "1  [  Scikit-learn ,   TensorFlow ,  Keras ,  PyT...  [ Amazon SageMaker ]   \n",
       "2                                                 []                    []   \n",
       "3  [  Scikit-learn ,   TensorFlow ,  Keras ,  Xgb...           [No / None]   \n",
       "4                                                 []                    []   \n",
       "\n",
       "                                           viz_tools  \\\n",
       "0                       [ Matplotlib ,  Geoplotlib ]   \n",
       "1  [ Matplotlib ,  Seaborn ,  Ggplot / ggplot2 , ...   \n",
       "2                                          [ D3 js ]   \n",
       "3  [ Matplotlib ,  Seaborn ,  Plotly / Plotly Exp...   \n",
       "4                                                 []   \n",
       "\n",
       "                                        social_media  \n",
       "0  [Kaggle (notebooks, forums, etc), Journal Publ...  \n",
       "1  [Twitter (data science influencers), Reddit (r...  \n",
       "2  [Email newsletters (Data Elixir, O'Reilly Data...  \n",
       "3                                             [None]  \n",
       "4                                                 []  "
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def drop_nan(line):\n",
    "\n",
    "    return [x for x in line if str(x) != 'nan']\n",
    "\n",
    "\n",
    "df = pd.DataFrame()\n",
    "\n",
    "df['country'] = orig_df['Q3']\n",
    "df['languages'] = orig_df[['Q7_Part_1', 'Q7_Part_2', 'Q7_Part_3', 'Q7_Part_4', 'Q7_Part_5',\n",
    "                           'Q7_Part_6', 'Q7_Part_7', 'Q7_Part_8', 'Q7_Part_9', 'Q7_Part_10',\n",
    "                           'Q7_Part_11', 'Q7_Part_12', 'Q7_OTHER']].values.tolist()\n",
    "\n",
    "df['databases'] = orig_df[['Q29_B_Part_1', 'Q29_B_Part_2', 'Q29_B_Part_3', 'Q29_B_Part_4',\n",
    "                           'Q29_B_Part_5', 'Q29_B_Part_6', 'Q29_B_Part_7', 'Q29_B_Part_8',\n",
    "                           'Q29_B_Part_9', 'Q29_B_Part_10', 'Q29_B_Part_11', 'Q29_B_Part_12',\n",
    "                           'Q29_B_Part_13', 'Q29_B_Part_14', 'Q29_B_Part_15', 'Q29_B_Part_16',\n",
    "                           'Q29_B_Part_17', 'Q29_B_OTHER']].values.tolist()\n",
    "\n",
    "df['auto_ml'] = orig_df[['Q34_B_Part_1', 'Q34_B_Part_2', 'Q34_B_Part_3', 'Q34_B_Part_4',\n",
    "                         'Q34_B_Part_5', 'Q34_B_Part_6', 'Q34_B_Part_7', 'Q34_B_Part_8',\n",
    "                         'Q34_B_Part_9', 'Q34_B_Part_10', 'Q34_B_Part_11', 'Q34_B_OTHER']].values.tolist()\n",
    "\n",
    "df['frameworks'] = orig_df[['Q16_Part_1', 'Q16_Part_2', 'Q16_Part_3', 'Q16_Part_4',\n",
    "                            'Q16_Part_5', 'Q16_Part_6', 'Q16_Part_7', 'Q16_Part_8',\n",
    "                            'Q16_Part_9', 'Q16_Part_10', 'Q16_Part_11', 'Q16_Part_12',\n",
    "                            'Q16_Part_13', 'Q16_Part_14', 'Q16_Part_15', 'Q16_OTHER']].values.tolist()\n",
    "\n",
    "\n",
    "df['ml_products'] = orig_df[['Q28_A_Part_1', 'Q28_A_Part_2', 'Q28_A_Part_3', 'Q28_A_Part_4',\n",
    "                             'Q28_A_Part_5', 'Q28_A_Part_6', 'Q28_A_Part_7', 'Q28_A_Part_8',\n",
    "                             'Q28_A_Part_9', 'Q28_A_Part_10', 'Q28_A_OTHER']].values.tolist()\n",
    "\n",
    "df['viz_tools'] = orig_df[['Q14_Part_1', 'Q14_Part_2', 'Q14_Part_3', 'Q14_Part_4',\n",
    "                           'Q14_Part_5', 'Q14_Part_6', 'Q14_Part_7', 'Q14_Part_8',\n",
    "                           'Q14_Part_9', 'Q14_Part_10', 'Q14_Part_11', 'Q14_OTHER']].values.tolist()\n",
    "\n",
    "df['social_media'] = orig_df[['Q39_Part_1', 'Q39_Part_2', 'Q39_Part_3', 'Q39_Part_4',\n",
    "                              'Q39_Part_5', 'Q39_Part_6', 'Q39_Part_7', 'Q39_Part_8',\n",
    "                              'Q39_Part_9', 'Q39_Part_10', 'Q39_Part_11', 'Q39_OTHER']].values.tolist()\n",
    "\n",
    "df['current_role'] = orig_df[['Q5']]\n",
    "df['num_years_coding'] = orig_df[['Q6']]\n",
    "df['num_data_scientist_team'] = orig_df['Q21']\n",
    "df['ml_budget'] = orig_df[['Q25']]\n",
    "df['recommended_language'] = orig_df[['Q8']]\n",
    "df['most_used_database'] = orig_df[['Q30']]\n",
    "\n",
    "df = df.loc[1:, :]\n",
    "\n",
    "df['clean_languages'] = df['languages'].map(drop_nan)\n",
    "df['clean_databases'] = df['databases'].map(drop_nan)\n",
    "df['clean_auto_ml'] = df['auto_ml'].map(drop_nan)\n",
    "df['clean_frameworks'] = df['frameworks'].map(drop_nan)\n",
    "df['clean_ml_products'] = df['ml_products'].map(drop_nan)\n",
    "df['clean_viz_tools'] = df['viz_tools'].map(drop_nan)\n",
    "df['clean_social_media'] = df['social_media'].map(drop_nan)\n",
    "\n",
    "df2 = df.drop(['languages'], axis=1)\n",
    "df2 = df2.drop(['databases', 'auto_ml', 'frameworks', 'ml_products', 'viz_tools', 'social_media'], axis=1)\n",
    "df2 = df2.reset_index()\n",
    "df2.columns = ['id', 'country', 'current_role', 'num_years_coding', \n",
    "               'num_data_scientist_team', 'ml_budget', 'recommended_language', 'most_used_database', \n",
    "               'languages', 'databases', 'auto_ml', 'frameworks', \n",
    "               'ml_products', 'viz_tools', 'social_media']\n",
    "df2.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "d302a0d0",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "eefd6da9",
   "metadata": {},
   "outputs": [],
   "source": [
    "class Neo4jConnection:\n",
    "    \n",
    "    def __init__(self, uri, user, pwd):\n",
    "        self.__uri = uri\n",
    "        self.__user = user\n",
    "        self.__pwd = pwd\n",
    "        self.__driver = None\n",
    "        try:\n",
    "            self.__driver = GraphDatabase.driver(self.__uri, auth=(self.__user, self.__pwd))\n",
    "        except Exception as e:\n",
    "            print(\"Failed to create the driver:\", e)\n",
    "        \n",
    "    def close(self):\n",
    "        if self.__driver is not None:\n",
    "            self.__driver.close()\n",
    "        \n",
    "    def query(self, query, parameters=None, db=None):\n",
    "        assert self.__driver is not None, \"Driver not initialized!\"\n",
    "        session = None\n",
    "        response = None\n",
    "        try: \n",
    "            session = self.__driver.session(database=db) if db is not None else self.__driver.session() \n",
    "            response = list(session.run(query, parameters))\n",
    "        except Exception as e:\n",
    "            print(\"Query failed:\", e)\n",
    "        finally: \n",
    "            if session is not None:\n",
    "                session.close()\n",
    "        return response"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "247f9783",
   "metadata": {},
   "source": [
    "## This is what the connection looks like when going through Docker \n",
    "\n",
    "Note the user name and password are specified in the `docker-compose.yml` file."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "6bf28015",
   "metadata": {},
   "outputs": [],
   "source": [
    "conn = Neo4jConnection(uri=\"bolt://neo4j:7687\", user=\"neo4j\", pwd=\"1234\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "388872a8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "conn.query('CREATE CONSTRAINT ids IF NOT EXISTS ON (i:Id) ASSERT i.id IS UNIQUE')\n",
    "conn.query('CREATE CONSTRAINT languages IF NOT EXISTS ON (l:Language) ASSERT l.name IS UNIQUE')\n",
    "conn.query('CREATE CONSTRAINT databases IF NOT EXISTS ON (d:Database) ASSERT d.name IS UNIQUE')\n",
    "conn.query('CREATE CONSTRAINT automl IF NOT EXISTS ON (a:AutoMl) ASSERT a.name IS UNIQUE')\n",
    "conn.query('CREATE CONSTRAINT frameworks IF NOT EXISTS ON (f:Framework) ASSERT f.name IS UNIQUE')\n",
    "conn.query('CREATE CONSTRAINT products IF NOT EXISTS ON (p:MlProduct) ASSERT p.name IS UNIQUE')\n",
    "conn.query('CREATE CONSTRAINT viztools IF NOT EXISTS ON (v:VizTool) ASSERT v.name IS UNIQUE')\n",
    "conn.query('CREATE CONSTRAINT socialmedia IF NOT EXISTS ON (s:SocialMedia) ASSERT s.name IS UNIQUE')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b6f5ee22",
   "metadata": {},
   "source": [
    "## These are a whole bunch of functions that take parts of the dataframe and turn them into nodes and relationships within the graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "f1e24169",
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_ids(rows, batch_size=1000):\n",
    "    # Adds author nodes to the Neo4j graph as a batch job.\n",
    "\n",
    "    query = '''UNWIND $rows AS row\n",
    "               MERGE (:Id {name: row.id, country: row.country, current_role: row.current_role, num_years_coding: row.num_years_coding, num_data_scientist_team: row.num_data_scientist_team, ml_budget: row.ml_budget})\n",
    "               RETURN count(*) as total\n",
    "    '''\n",
    "    return insert_data(query, rows, batch_size)\n",
    "\n",
    "\n",
    "def add_langs(rows, batch_size=1000):\n",
    "\n",
    "    query = \"\"\"UNWIND $rows AS row\n",
    "               UNWIND row.languages AS language\n",
    "               MERGE (:Language {name: language})\n",
    "               RETURN COUNT(*) AS total\n",
    "    \"\"\"\n",
    "    \n",
    "    return insert_data(query, rows, batch_size)\n",
    "\n",
    "\n",
    "def add_dbs(rows, batch_size=1000):\n",
    "\n",
    "    query = \"\"\"UNWIND $rows AS row\n",
    "               UNWIND row.databases AS database\n",
    "               MERGE (:Database {name: database})\n",
    "               RETURN COUNT(*) AS total\n",
    "    \"\"\"\n",
    "\n",
    "    return insert_data(query, rows, batch_size)\n",
    "\n",
    "\n",
    "def add_auto_ml(rows, batch_size=1000):\n",
    "\n",
    "    query = \"\"\"UNWIND $rows AS row\n",
    "               UNWIND row.auto_ml AS auto_ml\n",
    "               MERGE (:AutoMl {name: auto_ml})\n",
    "               RETURN COUNT(*) AS total\n",
    "    \"\"\"\n",
    "\n",
    "    return insert_data(query, rows, batch_size)\n",
    "\n",
    "\n",
    "def add_frameworks(rows, batch_size=1000):\n",
    "\n",
    "    query = \"\"\"UNWIND $rows AS row\n",
    "               UNWIND row.frameworks AS framework\n",
    "               MERGE (:Framework {name: framework})\n",
    "               RETURN COUNT(*) AS total\n",
    "    \"\"\"\n",
    "\n",
    "    return insert_data(query, rows, batch_size)\n",
    "\n",
    "\n",
    "def add_products(rows, batch_size=1000):\n",
    "\n",
    "    query = \"\"\"UNWIND $rows AS row\n",
    "               UNWIND row.ml_products AS product\n",
    "               MERGE (:MlProduct {name: product})\n",
    "               RETURN COUNT(*) AS total\n",
    "    \"\"\"\n",
    "\n",
    "    return insert_data(query, rows, batch_size)\n",
    "\n",
    "\n",
    "def add_viz_tools(rows, batch_size=1000):\n",
    "\n",
    "    query = \"\"\"UNWIND $rows AS row\n",
    "               UNWIND row.viz_tools AS viz_tool\n",
    "               MERGE (:VizTool {name: viz_tool})\n",
    "               RETURN COUNT(*) AS total\n",
    "    \"\"\"\n",
    "\n",
    "    return insert_data(query, rows, batch_size)\n",
    "\n",
    "\n",
    "def add_social_media(rows, batch_size=1000):\n",
    "\n",
    "    query = \"\"\"UNWIND $rows AS row\n",
    "               UNWIND row.social_media AS social_media\n",
    "               MERGE (:SocialMedia {name: social_media})\n",
    "               RETURN COUNT(*) AS total\n",
    "    \"\"\"\n",
    "\n",
    "    return insert_data(query, rows, batch_size)\n",
    "\n",
    "\n",
    "def add_all_lang_rels(rows, batch_size=500):\n",
    "    # Adds paper nodes and (:Author)--(:Paper) and (:Paper)--(:Category)\n",
    "    # relationships to the Neo4j graph as a batch job.  (Note the smaller batch\n",
    "    # size due to the fact that this function is adding much more data than the\n",
    "    # add_authors() function.)\n",
    "\n",
    "    query = \"\"\"UNWIND $rows AS row\n",
    "               UNWIND row.languages AS language\n",
    "               MATCH (i:Id {name: row.id})\n",
    "               MATCH (l:Language {name: language})\n",
    "               MERGE (i)-[:USES_LANGUAGE]->(l)\n",
    "               RETURN COUNT(*) AS total\n",
    "    \"\"\"\n",
    "\n",
    "    return insert_data(query, rows, batch_size)\n",
    "\n",
    "\n",
    "def add_rec_lang_rel(rows, batch_size=500):\n",
    "\n",
    "    query = \"\"\"UNWIND $rows AS row\n",
    "               MATCH (i:Id {name: row.id})\n",
    "               MATCH (l:Language {name: row.recommended_language})\n",
    "               MERGE (i)-[:RECOMMENDS_LANGUAGE]->(l)\n",
    "               RETURN COUNT(*) AS total\n",
    "    \"\"\"\n",
    "\n",
    "    return insert_data(query, rows, batch_size)\n",
    "\n",
    "\n",
    "def add_all_db_rels(rows, batch_size=500):\n",
    "\n",
    "    query = \"\"\"UNWIND $rows AS row\n",
    "               UNWIND row.databases AS database\n",
    "               MATCH (i:Id {name: row.id})\n",
    "               MATCH (d:Database {name: database})\n",
    "               MERGE (i)-[:USES_DATABASE]->(d)\n",
    "               RETURN COUNT(*) AS total\n",
    "    \"\"\"\n",
    "\n",
    "    return insert_data(query, rows, batch_size)\n",
    "\n",
    "\n",
    "def add_most_used_db_rel(rows, batch_size=500):\n",
    "\n",
    "    query = \"\"\"UNWIND $rows AS row\n",
    "               MATCH (i:Id {name: row.id})\n",
    "               MATCH (d:Database {name: row.most_used_database})\n",
    "               MERGE (i)-[:MOST_OFTEN_USED_DB]->(d)\n",
    "               RETURN COUNT(*) AS total\n",
    "    \"\"\"\n",
    "\n",
    "    return insert_data(query, rows, batch_size)\n",
    "\n",
    "\n",
    "def add_auto_ml_rels(rows, batch_size=500):\n",
    "\n",
    "    query = \"\"\"UNWIND $rows AS row\n",
    "               UNWIND row.auto_ml AS auto_ml\n",
    "               MATCH (i:Id {name: row.id})\n",
    "               MATCH (a:AutoMl {name: auto_ml})\n",
    "               MERGE (i)-[:USES_AUTO_ML]->(a)\n",
    "               RETURN COUNT(*) AS total\n",
    "    \"\"\"\n",
    "\n",
    "    return insert_data(query, rows, batch_size)\n",
    "\n",
    "\n",
    "def add_framework_rels(rows, batch_size=500):\n",
    "\n",
    "    query = \"\"\"UNWIND $rows AS row\n",
    "               UNWIND row.frameworks AS framework\n",
    "               MATCH (i:Id {name: row.id})\n",
    "               MATCH (f:Framework {name: framework})\n",
    "               MERGE (i)-[:USES_FRAMEWORK]->(f)\n",
    "               RETURN COUNT(*) AS total\n",
    "    \"\"\"\n",
    "\n",
    "    return insert_data(query, rows, batch_size)\n",
    "\n",
    "\n",
    "def add_product_rels(rows, batch_size=500):\n",
    "\n",
    "    query = \"\"\"UNWIND $rows AS row\n",
    "               UNWIND row.ml_products AS product\n",
    "               MATCH (i:Id {name: row.id})\n",
    "               MATCH (p:MlProduct {name: product})\n",
    "               MERGE (i)-[:USES_ML_PROD]->(p)\n",
    "               RETURN COUNT(*) AS total\n",
    "    \"\"\"\n",
    "\n",
    "    return insert_data(query, rows, batch_size)\n",
    "\n",
    "\n",
    "def add_viz_tool_rels(rows, batch_size=500):\n",
    "\n",
    "    query = \"\"\"UNWIND $rows AS row\n",
    "               UNWIND row.viz_tools AS viz_tool\n",
    "               MATCH (i:Id {name: row.id})\n",
    "               MATCH (v:VizTool {name: viz_tool})\n",
    "               MERGE (i)-[:USES_VIZ_TOOL]->(v)\n",
    "               RETURN COUNT(*) AS total\n",
    "    \"\"\"\n",
    "\n",
    "    return insert_data(query, rows, batch_size)\n",
    "\n",
    "\n",
    "def add_social_media_rels(rows, batch_size=500):\n",
    "\n",
    "    query = \"\"\"UNWIND $rows AS row\n",
    "               UNWIND row.social_media AS social_media\n",
    "               MATCH (i:Id {name: row.id})\n",
    "               MATCH (s:SocialMedia {name: social_media})\n",
    "               MERGE (i)-[:USES_SOCIAL_MEDIA]->(s)\n",
    "               RETURN COUNT(*) AS total\n",
    "    \"\"\"\n",
    "\n",
    "    return insert_data(query, rows, batch_size)\n",
    "\n",
    "\n",
    "def insert_data(query, rows, batch_size = 10000):\n",
    "    # Function to handle the updating the Neo4j database in batch mode.\n",
    "\n",
    "    total = 0\n",
    "    batch = 0\n",
    "    start = time.time()\n",
    "    result = None\n",
    "\n",
    "    while batch * batch_size < len(rows):\n",
    "\n",
    "        res = conn.query(query, parameters={'rows': rows[batch*batch_size:(batch+1)*batch_size].to_dict('records')})\n",
    "        total += res[0]['total']\n",
    "        batch += 1\n",
    "        result = {\"total\":total, \"batches\":batch, \"time\":time.time()-start}\n",
    "        print(result)\n",
    "\n",
    "    return result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "f1f3dc05",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'total': 1000, 'batches': 1, 'time': 0.962932825088501}\n",
      "{'total': 2000, 'batches': 2, 'time': 2.0747017860412598}\n",
      "{'total': 3000, 'batches': 3, 'time': 3.638833522796631}\n",
      "{'total': 4000, 'batches': 4, 'time': 5.761361837387085}\n",
      "{'total': 5000, 'batches': 5, 'time': 8.35218620300293}\n",
      "{'total': 6000, 'batches': 6, 'time': 11.466829299926758}\n",
      "{'total': 7000, 'batches': 7, 'time': 15.179715871810913}\n",
      "{'total': 8000, 'batches': 8, 'time': 19.41966438293457}\n",
      "{'total': 9000, 'batches': 9, 'time': 24.212233781814575}\n",
      "{'total': 10000, 'batches': 10, 'time': 29.517643690109253}\n",
      "{'total': 11000, 'batches': 11, 'time': 34.46762037277222}\n",
      "{'total': 12000, 'batches': 12, 'time': 39.85889005661011}\n",
      "{'total': 13000, 'batches': 13, 'time': 45.58579659461975}\n",
      "{'total': 14000, 'batches': 14, 'time': 51.62421679496765}\n",
      "{'total': 15000, 'batches': 15, 'time': 58.157466888427734}\n",
      "{'total': 16000, 'batches': 16, 'time': 65.10491633415222}\n",
      "{'total': 17000, 'batches': 17, 'time': 72.47278237342834}\n",
      "{'total': 18000, 'batches': 18, 'time': 80.46384406089783}\n",
      "{'total': 19000, 'batches': 19, 'time': 88.71698641777039}\n",
      "{'total': 20000, 'batches': 20, 'time': 97.36329698562622}\n",
      "{'total': 20036, 'batches': 21, 'time': 97.69752478599548}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'total': 20036, 'batches': 21, 'time': 97.69752478599548}"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "add_ids(df2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "123fdd79",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'total': 2291, 'batches': 1, 'time': 0.3669300079345703}\n",
      "{'total': 4621, 'batches': 2, 'time': 0.6144332885742188}\n",
      "{'total': 6992, 'batches': 3, 'time': 0.8470773696899414}\n",
      "{'total': 9290, 'batches': 4, 'time': 1.0902841091156006}\n",
      "{'total': 11639, 'batches': 5, 'time': 1.3264706134796143}\n",
      "{'total': 14003, 'batches': 6, 'time': 1.5995230674743652}\n",
      "{'total': 16376, 'batches': 7, 'time': 1.827732801437378}\n",
      "{'total': 18806, 'batches': 8, 'time': 2.047433853149414}\n",
      "{'total': 21146, 'batches': 9, 'time': 2.2674665451049805}\n",
      "{'total': 23440, 'batches': 10, 'time': 2.4922542572021484}\n",
      "{'total': 25801, 'batches': 11, 'time': 2.716212511062622}\n",
      "{'total': 28249, 'batches': 12, 'time': 2.9377639293670654}\n",
      "{'total': 30672, 'batches': 13, 'time': 3.157878875732422}\n",
      "{'total': 33107, 'batches': 14, 'time': 3.377192497253418}\n",
      "{'total': 35438, 'batches': 15, 'time': 3.6151981353759766}\n",
      "{'total': 37787, 'batches': 16, 'time': 3.857487916946411}\n",
      "{'total': 40192, 'batches': 17, 'time': 4.087592124938965}\n",
      "{'total': 42525, 'batches': 18, 'time': 4.306246280670166}\n",
      "{'total': 44956, 'batches': 19, 'time': 4.54225492477417}\n",
      "{'total': 47359, 'batches': 20, 'time': 4.7841408252716064}\n",
      "{'total': 47450, 'batches': 21, 'time': 4.797094821929932}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'total': 47450, 'batches': 21, 'time': 4.797094821929932}"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "add_langs(df2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "ad6c3799",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'total': 1159, 'batches': 1, 'time': 11.89229679107666}\n",
      "{'total': 2291, 'batches': 2, 'time': 23.27991819381714}\n",
      "{'total': 3461, 'batches': 3, 'time': 34.94558382034302}\n",
      "{'total': 4621, 'batches': 4, 'time': 46.61304759979248}\n",
      "{'total': 5792, 'batches': 5, 'time': 58.486855268478394}\n",
      "{'total': 6992, 'batches': 6, 'time': 70.42991471290588}\n",
      "{'total': 8166, 'batches': 7, 'time': 82.17660880088806}\n",
      "{'total': 9290, 'batches': 8, 'time': 93.43988561630249}\n",
      "{'total': 10466, 'batches': 9, 'time': 105.22930908203125}\n",
      "{'total': 11639, 'batches': 10, 'time': 117.05418014526367}\n",
      "{'total': 12803, 'batches': 11, 'time': 128.0705099105835}\n",
      "{'total': 14003, 'batches': 12, 'time': 139.32308197021484}\n",
      "{'total': 15178, 'batches': 13, 'time': 150.3031027317047}\n",
      "{'total': 16376, 'batches': 14, 'time': 161.52330136299133}\n",
      "{'total': 17614, 'batches': 15, 'time': 173.05547523498535}\n",
      "{'total': 18806, 'batches': 16, 'time': 184.19707560539246}\n",
      "{'total': 19954, 'batches': 17, 'time': 194.90309500694275}\n",
      "{'total': 21146, 'batches': 18, 'time': 206.0372953414917}\n",
      "{'total': 22343, 'batches': 19, 'time': 217.25702238082886}\n",
      "{'total': 23440, 'batches': 20, 'time': 227.5722496509552}\n",
      "{'total': 24627, 'batches': 21, 'time': 238.76871585845947}\n",
      "{'total': 25801, 'batches': 22, 'time': 249.82795119285583}\n",
      "{'total': 27001, 'batches': 23, 'time': 260.9907555580139}\n",
      "{'total': 28249, 'batches': 24, 'time': 272.4587857723236}\n",
      "{'total': 29510, 'batches': 25, 'time': 283.95837926864624}\n",
      "{'total': 30672, 'batches': 26, 'time': 294.6606516838074}\n",
      "{'total': 31873, 'batches': 27, 'time': 305.73290061950684}\n",
      "{'total': 33107, 'batches': 28, 'time': 317.2976779937744}\n",
      "{'total': 34254, 'batches': 29, 'time': 328.00206112861633}\n",
      "{'total': 35438, 'batches': 30, 'time': 339.088015794754}\n",
      "{'total': 36610, 'batches': 31, 'time': 349.99962091445923}\n",
      "{'total': 37787, 'batches': 32, 'time': 360.9243583679199}\n",
      "{'total': 38931, 'batches': 33, 'time': 371.5949635505676}\n",
      "{'total': 40192, 'batches': 34, 'time': 383.2375719547272}\n",
      "{'total': 41336, 'batches': 35, 'time': 394.0556752681732}\n",
      "{'total': 42525, 'batches': 36, 'time': 405.10387206077576}\n",
      "{'total': 43730, 'batches': 37, 'time': 416.3383438587189}\n",
      "{'total': 44956, 'batches': 38, 'time': 427.776513338089}\n",
      "{'total': 46132, 'batches': 39, 'time': 438.74980640411377}\n",
      "{'total': 47359, 'batches': 40, 'time': 450.04081535339355}\n",
      "{'total': 47450, 'batches': 41, 'time': 450.88008856773376}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'total': 47450, 'batches': 41, 'time': 450.88008856773376}"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "add_all_lang_rels(df2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "663514d9",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'total': 443, 'batches': 1, 'time': 5.1144726276397705}\n",
      "{'total': 892, 'batches': 2, 'time': 10.160549402236938}\n",
      "{'total': 1339, 'batches': 3, 'time': 15.255979776382446}\n",
      "{'total': 1779, 'batches': 4, 'time': 20.316847801208496}\n",
      "{'total': 2216, 'batches': 5, 'time': 25.4208881855011}\n",
      "{'total': 2659, 'batches': 6, 'time': 30.4552800655365}\n",
      "{'total': 3097, 'batches': 7, 'time': 35.496543407440186}\n",
      "{'total': 3536, 'batches': 8, 'time': 40.48268532752991}\n",
      "{'total': 3980, 'batches': 9, 'time': 45.526402950286865}\n",
      "{'total': 4422, 'batches': 10, 'time': 50.66824412345886}\n",
      "{'total': 4870, 'batches': 11, 'time': 55.37342429161072}\n",
      "{'total': 5312, 'batches': 12, 'time': 60.115267753601074}\n",
      "{'total': 5757, 'batches': 13, 'time': 64.79586911201477}\n",
      "{'total': 6194, 'batches': 14, 'time': 69.53296494483948}\n",
      "{'total': 6644, 'batches': 15, 'time': 74.20875787734985}\n",
      "{'total': 7091, 'batches': 16, 'time': 78.8406434059143}\n",
      "{'total': 7541, 'batches': 17, 'time': 83.5461106300354}\n",
      "{'total': 7982, 'batches': 18, 'time': 88.24712824821472}\n",
      "{'total': 8440, 'batches': 19, 'time': 92.99783253669739}\n",
      "{'total': 8884, 'batches': 20, 'time': 97.70945930480957}\n",
      "{'total': 9320, 'batches': 21, 'time': 102.42527675628662}\n",
      "{'total': 9759, 'batches': 22, 'time': 107.18986749649048}\n",
      "{'total': 10207, 'batches': 23, 'time': 111.91008615493774}\n",
      "{'total': 10647, 'batches': 24, 'time': 116.62090945243835}\n",
      "{'total': 11098, 'batches': 25, 'time': 121.33862090110779}\n",
      "{'total': 11539, 'batches': 26, 'time': 126.15891289710999}\n",
      "{'total': 11977, 'batches': 27, 'time': 130.88460540771484}\n",
      "{'total': 12431, 'batches': 28, 'time': 135.6205952167511}\n",
      "{'total': 12870, 'batches': 29, 'time': 140.3784852027893}\n",
      "{'total': 13320, 'batches': 30, 'time': 145.10671377182007}\n",
      "{'total': 13760, 'batches': 31, 'time': 149.9442219734192}\n",
      "{'total': 14209, 'batches': 32, 'time': 154.81346011161804}\n",
      "{'total': 14654, 'batches': 33, 'time': 159.66126203536987}\n",
      "{'total': 15114, 'batches': 34, 'time': 164.43632316589355}\n",
      "{'total': 15562, 'batches': 35, 'time': 169.28303050994873}\n",
      "{'total': 16008, 'batches': 36, 'time': 174.02675199508667}\n",
      "{'total': 16452, 'batches': 37, 'time': 178.86045289039612}\n",
      "{'total': 16899, 'batches': 38, 'time': 183.67063164710999}\n",
      "{'total': 17342, 'batches': 39, 'time': 188.52412581443787}\n",
      "{'total': 17787, 'batches': 40, 'time': 193.23427629470825}\n",
      "{'total': 17821, 'batches': 41, 'time': 193.60888409614563}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'total': 17821, 'batches': 41, 'time': 193.60888409614563}"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "add_rec_lang_rel(df2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "a3b1b9df",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'total': 1247, 'batches': 1, 'time': 0.256925106048584}\n",
      "{'total': 2700, 'batches': 2, 'time': 0.5005044937133789}\n",
      "{'total': 3974, 'batches': 3, 'time': 0.7249860763549805}\n",
      "{'total': 5399, 'batches': 4, 'time': 0.9405431747436523}\n",
      "{'total': 6775, 'batches': 5, 'time': 1.1606030464172363}\n",
      "{'total': 8074, 'batches': 6, 'time': 1.3782927989959717}\n",
      "{'total': 9430, 'batches': 7, 'time': 1.5980761051177979}\n",
      "{'total': 10887, 'batches': 8, 'time': 1.8158488273620605}\n",
      "{'total': 12334, 'batches': 9, 'time': 2.036309003829956}\n",
      "{'total': 13631, 'batches': 10, 'time': 2.261573553085327}\n",
      "{'total': 15124, 'batches': 11, 'time': 2.49010968208313}\n",
      "{'total': 16458, 'batches': 12, 'time': 2.712306022644043}\n",
      "{'total': 17839, 'batches': 13, 'time': 2.933023691177368}\n",
      "{'total': 19199, 'batches': 14, 'time': 3.1478054523468018}\n",
      "{'total': 20491, 'batches': 15, 'time': 3.3608572483062744}\n",
      "{'total': 21983, 'batches': 16, 'time': 3.5775535106658936}\n",
      "{'total': 23532, 'batches': 17, 'time': 3.8021605014801025}\n",
      "{'total': 24764, 'batches': 18, 'time': 4.023874521255493}\n",
      "{'total': 26013, 'batches': 19, 'time': 4.3137311935424805}\n",
      "{'total': 27311, 'batches': 20, 'time': 4.534435510635376}\n",
      "{'total': 27373, 'batches': 21, 'time': 4.546523094177246}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'total': 27373, 'batches': 21, 'time': 4.546523094177246}"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "add_dbs(df2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "9b9cb28b",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'total': 686, 'batches': 1, 'time': 6.955230474472046}\n",
      "{'total': 1247, 'batches': 2, 'time': 12.669395446777344}\n",
      "{'total': 2010, 'batches': 3, 'time': 20.498956203460693}\n",
      "{'total': 2700, 'batches': 4, 'time': 27.392053842544556}\n",
      "{'total': 3333, 'batches': 5, 'time': 33.78075408935547}\n",
      "{'total': 3974, 'batches': 6, 'time': 40.195393562316895}\n",
      "{'total': 4776, 'batches': 7, 'time': 48.24994683265686}\n",
      "{'total': 5399, 'batches': 8, 'time': 54.54207420349121}\n",
      "{'total': 6027, 'batches': 9, 'time': 60.865509033203125}\n",
      "{'total': 6775, 'batches': 10, 'time': 68.38058733940125}\n",
      "{'total': 7435, 'batches': 11, 'time': 74.60566210746765}\n",
      "{'total': 8074, 'batches': 12, 'time': 80.60880899429321}\n",
      "{'total': 8728, 'batches': 13, 'time': 86.76592469215393}\n",
      "{'total': 9430, 'batches': 14, 'time': 93.35770153999329}\n",
      "{'total': 10223, 'batches': 15, 'time': 100.77417993545532}\n",
      "{'total': 10887, 'batches': 16, 'time': 107.00645613670349}\n",
      "{'total': 11555, 'batches': 17, 'time': 113.32725834846497}\n",
      "{'total': 12334, 'batches': 18, 'time': 120.7557909488678}\n",
      "{'total': 13060, 'batches': 19, 'time': 127.54615259170532}\n",
      "{'total': 13631, 'batches': 20, 'time': 132.82860398292542}\n",
      "{'total': 14408, 'batches': 21, 'time': 140.02157068252563}\n",
      "{'total': 15124, 'batches': 22, 'time': 146.60238599777222}\n",
      "{'total': 15798, 'batches': 23, 'time': 152.83585381507874}\n",
      "{'total': 16458, 'batches': 24, 'time': 158.9724826812744}\n",
      "{'total': 17124, 'batches': 25, 'time': 165.252188205719}\n",
      "{'total': 17839, 'batches': 26, 'time': 171.91828656196594}\n",
      "{'total': 18486, 'batches': 27, 'time': 178.02215909957886}\n",
      "{'total': 19199, 'batches': 28, 'time': 184.58955931663513}\n",
      "{'total': 19782, 'batches': 29, 'time': 189.97122168540955}\n",
      "{'total': 20491, 'batches': 30, 'time': 196.56610107421875}\n",
      "{'total': 21258, 'batches': 31, 'time': 203.70803666114807}\n",
      "{'total': 21983, 'batches': 32, 'time': 210.52699089050293}\n",
      "{'total': 22720, 'batches': 33, 'time': 217.54211163520813}\n",
      "{'total': 23532, 'batches': 34, 'time': 225.0357141494751}\n",
      "{'total': 24112, 'batches': 35, 'time': 230.46195530891418}\n",
      "{'total': 24764, 'batches': 36, 'time': 236.68915963172913}\n",
      "{'total': 25364, 'batches': 37, 'time': 242.34217429161072}\n",
      "{'total': 26013, 'batches': 38, 'time': 248.39024543762207}\n",
      "{'total': 26643, 'batches': 39, 'time': 254.3494324684143}\n",
      "{'total': 27311, 'batches': 40, 'time': 260.497930765152}\n",
      "{'total': 27373, 'batches': 41, 'time': 261.0800607204437}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'total': 27373, 'batches': 41, 'time': 261.0800607204437}"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "add_all_db_rels(df2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "d444462f",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'total': 78, 'batches': 1, 'time': 5.1052565574646}\n",
      "{'total': 173, 'batches': 2, 'time': 10.214683055877686}\n",
      "{'total': 264, 'batches': 3, 'time': 15.30597710609436}\n",
      "{'total': 348, 'batches': 4, 'time': 20.380758047103882}\n",
      "{'total': 427, 'batches': 5, 'time': 25.46423077583313}\n",
      "{'total': 529, 'batches': 6, 'time': 30.59005618095398}\n",
      "{'total': 600, 'batches': 7, 'time': 35.609539270401}\n",
      "{'total': 680, 'batches': 8, 'time': 40.834779024124146}\n",
      "{'total': 772, 'batches': 9, 'time': 45.91334795951843}\n",
      "{'total': 841, 'batches': 10, 'time': 50.97310829162598}\n",
      "{'total': 933, 'batches': 11, 'time': 55.695130348205566}\n",
      "{'total': 1027, 'batches': 12, 'time': 60.38695573806763}\n",
      "{'total': 1116, 'batches': 13, 'time': 65.07891774177551}\n",
      "{'total': 1194, 'batches': 14, 'time': 69.81154537200928}\n",
      "{'total': 1273, 'batches': 15, 'time': 74.57708525657654}\n",
      "{'total': 1359, 'batches': 16, 'time': 79.37392091751099}\n",
      "{'total': 1454, 'batches': 17, 'time': 84.24772310256958}\n",
      "{'total': 1540, 'batches': 18, 'time': 89.04233050346375}\n",
      "{'total': 1640, 'batches': 19, 'time': 93.75055050849915}\n",
      "{'total': 1725, 'batches': 20, 'time': 98.45702695846558}\n",
      "{'total': 1808, 'batches': 21, 'time': 103.13501119613647}\n",
      "{'total': 1895, 'batches': 22, 'time': 107.86359286308289}\n",
      "{'total': 1988, 'batches': 23, 'time': 112.58219742774963}\n",
      "{'total': 2084, 'batches': 24, 'time': 117.3398048877716}\n",
      "{'total': 2168, 'batches': 25, 'time': 122.08755135536194}\n",
      "{'total': 2258, 'batches': 26, 'time': 126.83409929275513}\n",
      "{'total': 2334, 'batches': 27, 'time': 131.56267309188843}\n",
      "{'total': 2437, 'batches': 28, 'time': 136.27224588394165}\n",
      "{'total': 2522, 'batches': 29, 'time': 140.98096084594727}\n",
      "{'total': 2616, 'batches': 30, 'time': 145.70879459381104}\n",
      "{'total': 2697, 'batches': 31, 'time': 150.47932147979736}\n",
      "{'total': 2797, 'batches': 32, 'time': 155.252925157547}\n",
      "{'total': 2895, 'batches': 33, 'time': 160.0775911808014}\n",
      "{'total': 2982, 'batches': 34, 'time': 164.94197511672974}\n",
      "{'total': 3056, 'batches': 35, 'time': 169.7023208141327}\n",
      "{'total': 3150, 'batches': 36, 'time': 174.43027067184448}\n",
      "{'total': 3246, 'batches': 37, 'time': 179.08413100242615}\n",
      "{'total': 3340, 'batches': 38, 'time': 183.82551193237305}\n",
      "{'total': 3428, 'batches': 39, 'time': 188.51845479011536}\n",
      "{'total': 3506, 'batches': 40, 'time': 193.21102809906006}\n",
      "{'total': 3513, 'batches': 41, 'time': 193.5530321598053}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'total': 3513, 'batches': 41, 'time': 193.5530321598053}"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "add_most_used_db_rel(df2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "c6249859",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'total': 595, 'batches': 1, 'time': 0.23352670669555664}\n",
      "{'total': 1379, 'batches': 2, 'time': 0.4445183277130127}\n",
      "{'total': 2061, 'batches': 3, 'time': 0.6564750671386719}\n",
      "{'total': 2779, 'batches': 4, 'time': 0.8661506175994873}\n",
      "{'total': 3455, 'batches': 5, 'time': 1.075575590133667}\n",
      "{'total': 4171, 'batches': 6, 'time': 1.2876112461090088}\n",
      "{'total': 4930, 'batches': 7, 'time': 1.5002520084381104}\n",
      "{'total': 5633, 'batches': 8, 'time': 1.7160871028900146}\n",
      "{'total': 6405, 'batches': 9, 'time': 1.9316456317901611}\n",
      "{'total': 7065, 'batches': 10, 'time': 2.142219066619873}\n",
      "{'total': 7763, 'batches': 11, 'time': 2.3596107959747314}\n",
      "{'total': 8488, 'batches': 12, 'time': 2.573195695877075}\n",
      "{'total': 9128, 'batches': 13, 'time': 2.7900705337524414}\n",
      "{'total': 9812, 'batches': 14, 'time': 3.009068489074707}\n",
      "{'total': 10455, 'batches': 15, 'time': 3.227391242980957}\n",
      "{'total': 11147, 'batches': 16, 'time': 3.4374685287475586}\n",
      "{'total': 11927, 'batches': 17, 'time': 3.651763439178467}\n",
      "{'total': 12550, 'batches': 18, 'time': 3.922534704208374}\n",
      "{'total': 13157, 'batches': 19, 'time': 4.1380836963653564}\n",
      "{'total': 13872, 'batches': 20, 'time': 4.3490777015686035}\n",
      "{'total': 13921, 'batches': 21, 'time': 4.363068103790283}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'total': 13921, 'batches': 21, 'time': 4.363068103790283}"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "add_auto_ml(df2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "607857a7",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'total': 335, 'batches': 1, 'time': 3.5041697025299072}\n",
      "{'total': 595, 'batches': 2, 'time': 6.217179775238037}\n",
      "{'total': 1054, 'batches': 3, 'time': 10.9210045337677}\n",
      "{'total': 1379, 'batches': 4, 'time': 14.29832148551941}\n",
      "{'total': 1729, 'batches': 5, 'time': 17.915026426315308}\n",
      "{'total': 2061, 'batches': 6, 'time': 21.33316659927368}\n",
      "{'total': 2459, 'batches': 7, 'time': 25.371464729309082}\n",
      "{'total': 2779, 'batches': 8, 'time': 28.658487796783447}\n",
      "{'total': 3078, 'batches': 9, 'time': 31.75278902053833}\n",
      "{'total': 3455, 'batches': 10, 'time': 35.62026023864746}\n",
      "{'total': 3821, 'batches': 11, 'time': 39.15197682380676}\n",
      "{'total': 4171, 'batches': 12, 'time': 42.483396768569946}\n",
      "{'total': 4530, 'batches': 13, 'time': 45.91202521324158}\n",
      "{'total': 4930, 'batches': 14, 'time': 49.771788120269775}\n",
      "{'total': 5313, 'batches': 15, 'time': 53.44936752319336}\n",
      "{'total': 5633, 'batches': 16, 'time': 56.55524182319641}\n",
      "{'total': 6003, 'batches': 17, 'time': 60.110421895980835}\n",
      "{'total': 6405, 'batches': 18, 'time': 63.91778874397278}\n",
      "{'total': 6718, 'batches': 19, 'time': 66.91689157485962}\n",
      "{'total': 7065, 'batches': 20, 'time': 70.22811818122864}\n",
      "{'total': 7450, 'batches': 21, 'time': 73.85985040664673}\n",
      "{'total': 7763, 'batches': 22, 'time': 76.82081389427185}\n",
      "{'total': 8134, 'batches': 23, 'time': 80.32119536399841}\n",
      "{'total': 8488, 'batches': 24, 'time': 83.81761884689331}\n",
      "{'total': 8820, 'batches': 25, 'time': 86.97755479812622}\n",
      "{'total': 9128, 'batches': 26, 'time': 89.95790076255798}\n",
      "{'total': 9445, 'batches': 27, 'time': 93.03990387916565}\n",
      "{'total': 9812, 'batches': 28, 'time': 96.56023979187012}\n",
      "{'total': 10112, 'batches': 29, 'time': 99.43121457099915}\n",
      "{'total': 10455, 'batches': 30, 'time': 102.74623394012451}\n",
      "{'total': 10784, 'batches': 31, 'time': 105.87629461288452}\n",
      "{'total': 11147, 'batches': 32, 'time': 109.36210608482361}\n",
      "{'total': 11516, 'batches': 33, 'time': 112.88314485549927}\n",
      "{'total': 11927, 'batches': 34, 'time': 116.77006649971008}\n",
      "{'total': 12184, 'batches': 35, 'time': 119.23920679092407}\n",
      "{'total': 12550, 'batches': 36, 'time': 122.7245728969574}\n",
      "{'total': 12855, 'batches': 37, 'time': 125.6578905582428}\n",
      "{'total': 13157, 'batches': 38, 'time': 128.57070422172546}\n",
      "{'total': 13490, 'batches': 39, 'time': 131.80109930038452}\n",
      "{'total': 13872, 'batches': 40, 'time': 135.61782813072205}\n",
      "{'total': 13921, 'batches': 41, 'time': 136.1004753112793}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'total': 13921, 'batches': 41, 'time': 136.1004753112793}"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "add_auto_ml_rels(df2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "c51e277f",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'total': 1956, 'batches': 1, 'time': 0.24299407005310059}\n",
      "{'total': 4002, 'batches': 2, 'time': 0.4648299217224121}\n",
      "{'total': 5987, 'batches': 3, 'time': 0.6821470260620117}\n",
      "{'total': 7933, 'batches': 4, 'time': 0.9075586795806885}\n",
      "{'total': 9852, 'batches': 5, 'time': 1.1882734298706055}\n",
      "{'total': 11875, 'batches': 6, 'time': 1.4042229652404785}\n",
      "{'total': 13873, 'batches': 7, 'time': 1.6188857555389404}\n",
      "{'total': 15835, 'batches': 8, 'time': 1.8356127738952637}\n",
      "{'total': 17856, 'batches': 9, 'time': 2.050997734069824}\n",
      "{'total': 19776, 'batches': 10, 'time': 2.2648653984069824}\n",
      "{'total': 21790, 'batches': 11, 'time': 2.484682321548462}\n",
      "{'total': 23820, 'batches': 12, 'time': 2.7018654346466064}\n",
      "{'total': 25733, 'batches': 13, 'time': 2.9193856716156006}\n",
      "{'total': 27649, 'batches': 14, 'time': 3.1393206119537354}\n",
      "{'total': 29577, 'batches': 15, 'time': 3.3605055809020996}\n",
      "{'total': 31411, 'batches': 16, 'time': 3.57831072807312}\n",
      "{'total': 33441, 'batches': 17, 'time': 3.8029630184173584}\n",
      "{'total': 35364, 'batches': 18, 'time': 4.020085334777832}\n",
      "{'total': 37226, 'batches': 19, 'time': 4.236919641494751}\n",
      "{'total': 39093, 'batches': 20, 'time': 4.451922655105591}\n",
      "{'total': 39178, 'batches': 21, 'time': 4.4662933349609375}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'total': 39178, 'batches': 21, 'time': 4.4662933349609375}"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "add_frameworks(df2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "9a44e1eb",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'total': 994, 'batches': 1, 'time': 10.139696598052979}\n",
      "{'total': 1956, 'batches': 2, 'time': 19.899624824523926}\n",
      "{'total': 2996, 'batches': 3, 'time': 30.1230788230896}\n",
      "{'total': 4002, 'batches': 4, 'time': 40.13197994232178}\n",
      "{'total': 4957, 'batches': 5, 'time': 49.63934540748596}\n",
      "{'total': 5987, 'batches': 6, 'time': 59.84809374809265}\n",
      "{'total': 6975, 'batches': 7, 'time': 69.67918515205383}\n",
      "{'total': 7933, 'batches': 8, 'time': 79.23358869552612}\n",
      "{'total': 8906, 'batches': 9, 'time': 88.78422737121582}\n",
      "{'total': 9852, 'batches': 10, 'time': 98.12023448944092}\n",
      "{'total': 10880, 'batches': 11, 'time': 108.27761769294739}\n",
      "{'total': 11875, 'batches': 12, 'time': 118.09820914268494}\n",
      "{'total': 12848, 'batches': 13, 'time': 127.64952445030212}\n",
      "{'total': 13873, 'batches': 14, 'time': 137.636385679245}\n",
      "{'total': 14895, 'batches': 15, 'time': 146.95790886878967}\n",
      "{'total': 15835, 'batches': 16, 'time': 155.53625583648682}\n",
      "{'total': 16888, 'batches': 17, 'time': 165.22629117965698}\n",
      "{'total': 17856, 'batches': 18, 'time': 174.04905319213867}\n",
      "{'total': 18799, 'batches': 19, 'time': 182.6165053844452}\n",
      "{'total': 19776, 'batches': 20, 'time': 191.51195812225342}\n",
      "{'total': 20751, 'batches': 21, 'time': 200.40238857269287}\n",
      "{'total': 21790, 'batches': 22, 'time': 209.92505407333374}\n",
      "{'total': 22801, 'batches': 23, 'time': 219.15215754508972}\n",
      "{'total': 23820, 'batches': 24, 'time': 228.4949915409088}\n",
      "{'total': 24775, 'batches': 25, 'time': 237.28690886497498}\n",
      "{'total': 25733, 'batches': 26, 'time': 246.11582827568054}\n",
      "{'total': 26673, 'batches': 27, 'time': 254.73169565200806}\n",
      "{'total': 27649, 'batches': 28, 'time': 263.6436975002289}\n",
      "{'total': 28570, 'batches': 29, 'time': 272.1641080379486}\n",
      "{'total': 29577, 'batches': 30, 'time': 281.44047117233276}\n",
      "{'total': 30510, 'batches': 31, 'time': 290.0629267692566}\n",
      "{'total': 31411, 'batches': 32, 'time': 298.35525584220886}\n",
      "{'total': 32415, 'batches': 33, 'time': 307.6020314693451}\n",
      "{'total': 33441, 'batches': 34, 'time': 317.0010871887207}\n",
      "{'total': 34378, 'batches': 35, 'time': 325.5588409900665}\n",
      "{'total': 35364, 'batches': 36, 'time': 334.59559059143066}\n",
      "{'total': 36287, 'batches': 37, 'time': 343.0991384983063}\n",
      "{'total': 37226, 'batches': 38, 'time': 351.7381420135498}\n",
      "{'total': 38198, 'batches': 39, 'time': 360.68355107307434}\n",
      "{'total': 39093, 'batches': 40, 'time': 368.8301100730896}\n",
      "{'total': 39178, 'batches': 41, 'time': 369.6187958717346}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'total': 39178, 'batches': 41, 'time': 369.6187958717346}"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "add_framework_rels(df2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "edfc48c8",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'total': 296, 'batches': 1, 'time': 0.23112249374389648}\n",
      "{'total': 616, 'batches': 2, 'time': 0.4422037601470947}\n",
      "{'total': 927, 'batches': 3, 'time': 0.6494994163513184}\n",
      "{'total': 1216, 'batches': 4, 'time': 0.8597822189331055}\n",
      "{'total': 1500, 'batches': 5, 'time': 1.0659313201904297}\n",
      "{'total': 1796, 'batches': 6, 'time': 1.27449369430542}\n",
      "{'total': 2118, 'batches': 7, 'time': 1.486138105392456}\n",
      "{'total': 2422, 'batches': 8, 'time': 1.698072910308838}\n",
      "{'total': 2769, 'batches': 9, 'time': 1.9070448875427246}\n",
      "{'total': 3095, 'batches': 10, 'time': 2.1181142330169678}\n",
      "{'total': 3424, 'batches': 11, 'time': 2.3303258419036865}\n",
      "{'total': 3742, 'batches': 12, 'time': 2.542888641357422}\n",
      "{'total': 4048, 'batches': 13, 'time': 2.7523300647735596}\n",
      "{'total': 4365, 'batches': 14, 'time': 2.9630370140075684}\n",
      "{'total': 4688, 'batches': 15, 'time': 3.2319133281707764}\n",
      "{'total': 5036, 'batches': 16, 'time': 3.4414279460906982}\n",
      "{'total': 5366, 'batches': 17, 'time': 3.6547045707702637}\n",
      "{'total': 5704, 'batches': 18, 'time': 3.8663172721862793}\n",
      "{'total': 6048, 'batches': 19, 'time': 4.087813377380371}\n",
      "{'total': 6324, 'batches': 20, 'time': 4.294979572296143}\n",
      "{'total': 6335, 'batches': 21, 'time': 4.3083577156066895}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'total': 6335, 'batches': 21, 'time': 4.3083577156066895}"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "add_products(df2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "d1504bbb",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'total': 124, 'batches': 1, 'time': 1.3461270332336426}\n",
      "{'total': 296, 'batches': 2, 'time': 3.135993480682373}\n",
      "{'total': 459, 'batches': 3, 'time': 4.8466339111328125}\n",
      "{'total': 616, 'batches': 4, 'time': 6.493858814239502}\n",
      "{'total': 750, 'batches': 5, 'time': 7.91748571395874}\n",
      "{'total': 927, 'batches': 6, 'time': 9.772044897079468}\n",
      "{'total': 1070, 'batches': 7, 'time': 11.282859563827515}\n",
      "{'total': 1216, 'batches': 8, 'time': 12.81722116470337}\n",
      "{'total': 1371, 'batches': 9, 'time': 14.442493915557861}\n",
      "{'total': 1500, 'batches': 10, 'time': 15.82554316520691}\n",
      "{'total': 1650, 'batches': 11, 'time': 17.30285143852234}\n",
      "{'total': 1796, 'batches': 12, 'time': 18.746761560440063}\n",
      "{'total': 1941, 'batches': 13, 'time': 20.175037145614624}\n",
      "{'total': 2118, 'batches': 14, 'time': 21.887665033340454}\n",
      "{'total': 2268, 'batches': 15, 'time': 23.370591402053833}\n",
      "{'total': 2422, 'batches': 16, 'time': 24.87893772125244}\n",
      "{'total': 2596, 'batches': 17, 'time': 26.56310486793518}\n",
      "{'total': 2769, 'batches': 18, 'time': 28.23400855064392}\n",
      "{'total': 2938, 'batches': 19, 'time': 29.860628128051758}\n",
      "{'total': 3095, 'batches': 20, 'time': 31.38576579093933}\n",
      "{'total': 3253, 'batches': 21, 'time': 32.93478274345398}\n",
      "{'total': 3424, 'batches': 22, 'time': 34.604137897491455}\n",
      "{'total': 3572, 'batches': 23, 'time': 36.10143303871155}\n",
      "{'total': 3742, 'batches': 24, 'time': 37.7637357711792}\n",
      "{'total': 3879, 'batches': 25, 'time': 39.1160089969635}\n",
      "{'total': 4048, 'batches': 26, 'time': 40.75133466720581}\n",
      "{'total': 4204, 'batches': 27, 'time': 42.26771378517151}\n",
      "{'total': 4365, 'batches': 28, 'time': 43.83354663848877}\n",
      "{'total': 4520, 'batches': 29, 'time': 45.33504843711853}\n",
      "{'total': 4688, 'batches': 30, 'time': 46.957340478897095}\n",
      "{'total': 4858, 'batches': 31, 'time': 48.597646951675415}\n",
      "{'total': 5036, 'batches': 32, 'time': 50.30612111091614}\n",
      "{'total': 5209, 'batches': 33, 'time': 51.97535943984985}\n",
      "{'total': 5366, 'batches': 34, 'time': 53.51132655143738}\n",
      "{'total': 5535, 'batches': 35, 'time': 55.1384596824646}\n",
      "{'total': 5704, 'batches': 36, 'time': 56.76685643196106}\n",
      "{'total': 5867, 'batches': 37, 'time': 58.341196060180664}\n",
      "{'total': 6048, 'batches': 38, 'time': 60.09682512283325}\n",
      "{'total': 6175, 'batches': 39, 'time': 61.35387134552002}\n",
      "{'total': 6324, 'batches': 40, 'time': 62.80410075187683}\n",
      "{'total': 6335, 'batches': 41, 'time': 62.918365716934204}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'total': 6335, 'batches': 41, 'time': 62.918365716934204}"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "add_product_rels(df2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "a0b90a80",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'total': 1810, 'batches': 1, 'time': 0.23310542106628418}\n",
      "{'total': 3656, 'batches': 2, 'time': 0.4524707794189453}\n",
      "{'total': 5504, 'batches': 3, 'time': 0.6642856597900391}\n",
      "{'total': 7276, 'batches': 4, 'time': 0.874387264251709}\n",
      "{'total': 9027, 'batches': 5, 'time': 1.0867154598236084}\n",
      "{'total': 10855, 'batches': 6, 'time': 1.2995374202728271}\n",
      "{'total': 12617, 'batches': 7, 'time': 1.5122778415679932}\n",
      "{'total': 14461, 'batches': 8, 'time': 1.7280378341674805}\n",
      "{'total': 16306, 'batches': 9, 'time': 2.001425266265869}\n",
      "{'total': 18137, 'batches': 10, 'time': 2.216510057449341}\n",
      "{'total': 20001, 'batches': 11, 'time': 2.4364709854125977}\n",
      "{'total': 21868, 'batches': 12, 'time': 2.6520538330078125}\n",
      "{'total': 23687, 'batches': 13, 'time': 2.862121343612671}\n",
      "{'total': 25442, 'batches': 14, 'time': 3.0804665088653564}\n",
      "{'total': 27237, 'batches': 15, 'time': 3.2957308292388916}\n",
      "{'total': 29028, 'batches': 16, 'time': 3.5095276832580566}\n",
      "{'total': 30927, 'batches': 17, 'time': 3.722288131713867}\n",
      "{'total': 32803, 'batches': 18, 'time': 3.9353837966918945}\n",
      "{'total': 34578, 'batches': 19, 'time': 4.147767782211304}\n",
      "{'total': 36354, 'batches': 20, 'time': 4.356338024139404}\n",
      "{'total': 36440, 'batches': 21, 'time': 4.371080636978149}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'total': 36440, 'batches': 21, 'time': 4.371080636978149}"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "add_viz_tools(df2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "b226c5e1",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'total': 901, 'batches': 1, 'time': 8.83234691619873}\n",
      "{'total': 1810, 'batches': 2, 'time': 17.690585136413574}\n",
      "{'total': 2740, 'batches': 3, 'time': 26.763420343399048}\n",
      "{'total': 3656, 'batches': 4, 'time': 35.73404002189636}\n",
      "{'total': 4562, 'batches': 5, 'time': 44.62429642677307}\n",
      "{'total': 5504, 'batches': 6, 'time': 53.80964970588684}\n",
      "{'total': 6402, 'batches': 7, 'time': 62.637280225753784}\n",
      "{'total': 7276, 'batches': 8, 'time': 71.19492769241333}\n",
      "{'total': 8170, 'batches': 9, 'time': 79.95018005371094}\n",
      "{'total': 9027, 'batches': 10, 'time': 88.3766303062439}\n",
      "{'total': 9969, 'batches': 11, 'time': 96.94863653182983}\n",
      "{'total': 10855, 'batches': 12, 'time': 105.00119614601135}\n",
      "{'total': 11752, 'batches': 13, 'time': 113.21207642555237}\n",
      "{'total': 12617, 'batches': 14, 'time': 121.09486126899719}\n",
      "{'total': 13556, 'batches': 15, 'time': 129.65808582305908}\n",
      "{'total': 14461, 'batches': 16, 'time': 137.9289743900299}\n",
      "{'total': 15407, 'batches': 17, 'time': 146.5187304019928}\n",
      "{'total': 16306, 'batches': 18, 'time': 154.6912579536438}\n",
      "{'total': 17250, 'batches': 19, 'time': 163.26363492012024}\n",
      "{'total': 18137, 'batches': 20, 'time': 171.3075590133667}\n",
      "{'total': 19060, 'batches': 21, 'time': 179.69931030273438}\n",
      "{'total': 20001, 'batches': 22, 'time': 188.20022106170654}\n",
      "{'total': 20932, 'batches': 23, 'time': 196.62881660461426}\n",
      "{'total': 21868, 'batches': 24, 'time': 205.18014764785767}\n",
      "{'total': 22769, 'batches': 25, 'time': 213.45095658302307}\n",
      "{'total': 23687, 'batches': 26, 'time': 221.75084447860718}\n",
      "{'total': 24556, 'batches': 27, 'time': 229.6545226573944}\n",
      "{'total': 25442, 'batches': 28, 'time': 237.68165159225464}\n",
      "{'total': 26284, 'batches': 29, 'time': 245.35388040542603}\n",
      "{'total': 27237, 'batches': 30, 'time': 254.0441279411316}\n",
      "{'total': 28112, 'batches': 31, 'time': 261.99720191955566}\n",
      "{'total': 29028, 'batches': 32, 'time': 270.43949341773987}\n",
      "{'total': 29985, 'batches': 33, 'time': 279.1593234539032}\n",
      "{'total': 30927, 'batches': 34, 'time': 287.77765130996704}\n",
      "{'total': 31830, 'batches': 35, 'time': 295.946968793869}\n",
      "{'total': 32803, 'batches': 36, 'time': 304.7781069278717}\n",
      "{'total': 33672, 'batches': 37, 'time': 312.6584212779999}\n",
      "{'total': 34578, 'batches': 38, 'time': 320.87617206573486}\n",
      "{'total': 35438, 'batches': 39, 'time': 328.7119505405426}\n",
      "{'total': 36354, 'batches': 40, 'time': 337.00668835639954}\n",
      "{'total': 36440, 'batches': 41, 'time': 337.8044810295105}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'total': 36440, 'batches': 41, 'time': 337.8044810295105}"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "add_viz_tool_rels(df2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "3739e564",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'total': 1908, 'batches': 1, 'time': 0.2455582618713379}\n",
      "{'total': 3805, 'batches': 2, 'time': 0.4619781970977783}\n",
      "{'total': 5743, 'batches': 3, 'time': 0.6824765205383301}\n",
      "{'total': 7598, 'batches': 4, 'time': 0.8994946479797363}\n",
      "{'total': 9454, 'batches': 5, 'time': 1.1175293922424316}\n",
      "{'total': 11363, 'batches': 6, 'time': 1.3337392807006836}\n",
      "{'total': 13267, 'batches': 7, 'time': 1.5486805438995361}\n",
      "{'total': 15162, 'batches': 8, 'time': 1.7630622386932373}\n",
      "{'total': 17021, 'batches': 9, 'time': 1.9781427383422852}\n",
      "{'total': 18962, 'batches': 10, 'time': 2.19118070602417}\n",
      "{'total': 20898, 'batches': 11, 'time': 2.40975284576416}\n",
      "{'total': 22887, 'batches': 12, 'time': 2.624337911605835}\n",
      "{'total': 24739, 'batches': 13, 'time': 2.8388161659240723}\n",
      "{'total': 26568, 'batches': 14, 'time': 3.0576252937316895}\n",
      "{'total': 28409, 'batches': 15, 'time': 3.3332927227020264}\n",
      "{'total': 30258, 'batches': 16, 'time': 3.5432910919189453}\n",
      "{'total': 32276, 'batches': 17, 'time': 3.7607030868530273}\n",
      "{'total': 34223, 'batches': 18, 'time': 3.9733052253723145}\n",
      "{'total': 36126, 'batches': 19, 'time': 4.184136152267456}\n",
      "{'total': 37859, 'batches': 20, 'time': 4.397381067276001}\n",
      "{'total': 37937, 'batches': 21, 'time': 4.41117525100708}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'total': 37937, 'batches': 21, 'time': 4.41117525100708}"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "add_social_media(df2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "210395d9",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    }
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'total': 909, 'batches': 1, 'time': 9.051838159561157}\n",
      "{'total': 1908, 'batches': 2, 'time': 18.879411458969116}\n",
      "{'total': 2915, 'batches': 3, 'time': 28.764257669448853}\n",
      "{'total': 3805, 'batches': 4, 'time': 37.54251670837402}\n",
      "{'total': 4716, 'batches': 5, 'time': 46.53784775733948}\n",
      "{'total': 5743, 'batches': 6, 'time': 56.571343421936035}\n",
      "{'total': 6698, 'batches': 7, 'time': 65.93193101882935}\n",
      "{'total': 7598, 'batches': 8, 'time': 74.7197790145874}\n",
      "{'total': 8531, 'batches': 9, 'time': 83.82578921318054}\n",
      "{'total': 9454, 'batches': 10, 'time': 92.846839427948}\n",
      "{'total': 10396, 'batches': 11, 'time': 101.41671395301819}\n",
      "{'total': 11363, 'batches': 12, 'time': 110.2259840965271}\n",
      "{'total': 12263, 'batches': 13, 'time': 118.45732712745667}\n",
      "{'total': 13267, 'batches': 14, 'time': 127.56172060966492}\n",
      "{'total': 14231, 'batches': 15, 'time': 136.3156669139862}\n",
      "{'total': 15162, 'batches': 16, 'time': 144.7818365097046}\n",
      "{'total': 16087, 'batches': 17, 'time': 153.26465034484863}\n",
      "{'total': 17021, 'batches': 18, 'time': 161.78006505966187}\n",
      "{'total': 18012, 'batches': 19, 'time': 170.85388040542603}\n",
      "{'total': 18962, 'batches': 20, 'time': 179.53695940971375}\n",
      "{'total': 19921, 'batches': 21, 'time': 188.27169942855835}\n",
      "{'total': 20898, 'batches': 22, 'time': 197.23409366607666}\n",
      "{'total': 21866, 'batches': 23, 'time': 206.06196761131287}\n",
      "{'total': 22887, 'batches': 24, 'time': 215.29655027389526}\n",
      "{'total': 23767, 'batches': 25, 'time': 223.3618142604828}\n",
      "{'total': 24739, 'batches': 26, 'time': 232.2903962135315}\n",
      "{'total': 25605, 'batches': 27, 'time': 240.20474982261658}\n",
      "{'total': 26568, 'batches': 28, 'time': 248.96373867988586}\n",
      "{'total': 27412, 'batches': 29, 'time': 256.666250705719}\n",
      "{'total': 28409, 'batches': 30, 'time': 265.7321422100067}\n",
      "{'total': 29284, 'batches': 31, 'time': 273.7179682254791}\n",
      "{'total': 30258, 'batches': 32, 'time': 282.56909441947937}\n",
      "{'total': 31252, 'batches': 33, 'time': 291.59679412841797}\n",
      "{'total': 32276, 'batches': 34, 'time': 300.88450050354004}\n",
      "{'total': 33239, 'batches': 35, 'time': 309.63113808631897}\n",
      "{'total': 34223, 'batches': 36, 'time': 318.535786151886}\n",
      "{'total': 35161, 'batches': 37, 'time': 327.05059242248535}\n",
      "{'total': 36126, 'batches': 38, 'time': 335.7845690250397}\n",
      "{'total': 36974, 'batches': 39, 'time': 343.48988676071167}\n",
      "{'total': 37859, 'batches': 40, 'time': 351.58947491645813}\n",
      "{'total': 37937, 'batches': 41, 'time': 352.3045711517334}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "{'total': 37937, 'batches': 41, 'time': 352.3045711517334}"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "add_social_media_rels(df2)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bcefaab4",
   "metadata": {},
   "source": [
    "## The number of nodes and relationships in the graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "d36df202",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record COUNT(n)=20130>]"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "conn.query(\"MATCH (n) RETURN COUNT(n)\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "6cf536b3",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<Record COUNT(r)=229968>]"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "conn.query(\"MATCH ()-[r]->() RETURN COUNT(r)\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "09669dad",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
